In [1]:
import pandas as pd

In [4]:
data = pd.DataFrame({"Name":["Lalith","Abhi","Chandu","Jessy"],
                     "Age":[21,22,21,20],
                     "Role": ["Software Dev","Data Analyst","ML Dev","Ai Trainee"]})

In [3]:
data

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        Ml Dev
3   Jessy   20    Ai Trainee

In [5]:
data.describe()

             Age
count   4.000000
mean   21.000000
std     0.816497
min    20.000000
25%    20.750000
50%    21.000000
75%    21.250000
max    22.000000

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Role    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [7]:
data.dtypes

Name    object
Age      int64
Role    object
dtype: object

In [8]:
data["Age"].sum()

np.int64(84)

In [9]:
data["Age"].mean()

np.float64(21.0)

In [10]:
data.columns

Index(['Name', 'Age', 'Role'], dtype='object')

In [11]:
data.head(2)

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst

In [12]:
data.tail(2)

     Name  Age        Role
2  Chandu   21      ML Dev
3   Jessy   20  Ai Trainee

In [13]:
data.loc[2]

Name    Chandu
Age         21
Role    ML Dev
Name: 2, dtype: object

In [14]:
data.iloc[2]

Name    Chandu
Age         21
Role    ML Dev
Name: 2, dtype: object

In [16]:
data.Name

0    Lalith
1      Abhi
2    Chandu
3     Jessy
Name: Name, dtype: object

In [22]:
data[data["Age"]>21]

   Name  Age          Role
1  Abhi   22  Data Analyst

In [18]:
data.shape

(4, 3)

In [19]:
data[0:2:1]

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst

In [20]:
data

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee

In [23]:
data["Age"]

0    21
1    22
2    21
3    20
Name: Age, dtype: int64

In [26]:
data[["Name","Age"]]

     Name  Age
0  Lalith   21
1    Abhi   22
2  Chandu   21
3   Jessy   20

In [28]:
data[["Name","Age"]][0:3] #df[["column1",column2]][start:stop:step]

     Name  Age
0  Lalith   21
1    Abhi   22
2  Chandu   21

In [32]:
data.iloc[1,2]

'Data Analyst'

In [33]:
data

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee

In [35]:
data.iloc[1:3]

     Name  Age          Role
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev

In [39]:
data.iloc[0:,0]

0    Lalith
1      Abhi
2    Chandu
3     Jessy
Name: Name, dtype: object

In [42]:
data.iloc[:,[0,1]]

     Name  Age
0  Lalith   21
1    Abhi   22
2  Chandu   21
3   Jessy   20

In [43]:
data.iloc[::2]

     Name  Age          Role
0  Lalith   21  Software Dev
2  Chandu   21        ML Dev

In [46]:
data.sort_values(["Name","Age"])

     Name  Age          Role
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee
0  Lalith   21  Software Dev

In [55]:
data["Salary"] = 50000

In [56]:
data

     Name  Age          Role  Salary
0  Lalith   21  Software Dev   50000
1    Abhi   22  Data Analyst   50000
2  Chandu   21        ML Dev   50000
3   Jessy   20    Ai Trainee   50000

In [57]:
data.drop(columns =["Salary"])

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee

In [58]:
data

     Name  Age          Role  Salary
0  Lalith   21  Software Dev   50000
1    Abhi   22  Data Analyst   50000
2  Chandu   21        ML Dev   50000
3   Jessy   20    Ai Trainee   50000

In [59]:
data.drop(columns =["Salary"],inplace=True)

In [60]:
data

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee

In [62]:
data.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [63]:
data.drop_duplicates()

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee

In [65]:
data.dropna()

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee

In [66]:
data.fillna(900)

     Name  Age          Role
0  Lalith   21  Software Dev
1    Abhi   22  Data Analyst
2  Chandu   21        ML Dev
3   Jessy   20    Ai Trainee